W9D5/MusicApp/app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."band_id" = $1 ORDER BY "albums"."id" ASC LIMIT $2  [["band_id", 3], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" ORDER BY "albums"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def index
        if params.has_key?(:band_id)
            @albums = Album.where(band_id: params[:band_id])
        else
            @albums = Album.all

INSERT INTO "albums" ("title", "year", "live", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Run like a wind"], ["year", "2015"], ["live", false], ["band_id", 5], ["created_at", "2019-07-27 18:02:00.565609"], ["updated_at", "2019-07-27 18:02:00.565609"]]
---
    def create
        @album = Album.new(album_params)

        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "live" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["title", "Just a test"], ["live", true], ["updated_at", "2019-07-27 18:04:56.039228"], ["id", 2]]
---
    def update
        @album = Album.find(params[:id])

        if @album.update_attributes(album_params)