W9D5/MusicApp/app/controllers/bands_controller.rb

    def create
        @band = Band.new(band_pramas)

        if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Flower"], ["created_at", "2019-07-26 23:29:46.772836"], ["updated_at", "2019-07-26 23:29:46.772836"]]

    def update
        @band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]