W9D5/MusicApp/app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["track_id", 10], ["body", "lalala"], ["created_at", "2019-07-27 23:17:44.189825"], ["updated_at", "2019-07-27 23:17:44.189825"]]
---
    def create
        @note = Note.new(note_params)

        if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
    def destroy
        @note = Note.find(params[:id])

        if current_user && @note.user_id == current_user.id
            @note.destroy