W9D5/MusicApp/app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 4]]
---
    def index
        if params.has_key?(:album_id)
            @tracks = Track.where(album_id: params[:album_id])

INSERT INTO "tracks" ("title", "ord", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Leaf"], ["ord", 1], ["album_id", 3], ["created_at", "2019-07-27 20:24:14.940865"], ["updated_at", "2019-07-27 20:24:14.940865"]]
---
    def create
        @track = Track.new(track_params)

        if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "I'm testing!\r\nI'm testing!\r\nI'm testing!\r\nI'm testing!\r\n\r\n"], ["updated_at", "2019-07-28 00:11:47.223844"], ["id", 10]]
---
    def update
        @track = Track.find(params[:id])

        if @track.update_attributes(track_params)