W9D5/MusicApp/app/views/albums/edit.html.erb

SELECT "bands".* FROM "bands"
---
<option>--please select--</option>
<% Band.all.each do |band| %>