W9D5/MusicApp/app/views/albums/new.html.erb

<option>--please select--</option>
<% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"