W9D5/MusicApp/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 3]]
---
<h4>List of tracks from this album</h4>
<% @album.tracks.each do |track| %>