W9D5/MusicApp/app/views/tracks/_form.html.erb

<option>--Please Select--</option>
<% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"