W9D2/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"
---
    def show
        @artwork = Artwork.find(params[:id])
        @likers = []
        @artwork.likes.each do |like|

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "water lily"], ["id", 14]]
---
    def update
        artwork = Artwork.find(params[:id])
        artwork.update(artwork_params)