W9D2/app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            user_id = params[:user_id]
            comments = Comment.where(user_id: user_id)
            render json: comments

        elsif params[:artwork_id]
            artwork_id = params[:artwork_id]
            comments = Comment.where(artwork_id: artwork_id)
            render json: comments

        else
            render json: Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 15]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 18]]
SELECT "comments".* FROM "comments"