W9D2/app/controllers/users_controller.rb

    def index

        if params[:username]
            users = User.where('username LIKE ?', params[:username])
        else
            users = User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE 'robert')

    def update
        user = User.find(params[:id])
        user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "long"], ["id", 1]]